export default {
    fileid: '',
    filename:'',
    filecontent: '',
    activeid:'',
    isproject:'',
    dialogVisible:false,
    model1:'![ ](https://upload.shejihz.com/2019/03/0fbab89ce4d106b4a55609aebbb861ba.jpg)\n' +
        '\n' +
        '# 项目计划书\n' +
        '\n' +
        '## 第一部分：项目介绍\n' +
        '\n' +
        '### 1.项目概述\n' +
        '\n' +
        '1. 项目主题\n' +
        '   1. 概述1\n' +
        '   2. 概述2\n' +
        '   3. 概述3\n' +
        '2. 实施对象\n' +
        '   1. 对象1\n' +
        '   2. 对象2\n' +
        '3. 实施区域\n' +
        '   1. 区域1\n' +
        '   2. 区域2\n' +
        '\n' +
        '### 2.项目背景分析\n' +
        '\n' +
        '```echarts\n' +
        '{\n' +
        '  "title": { "text": "数据分析" },\n' +
        '  "tooltip": { "trigger": "axis", "axisPointer": { "lineStyle": { "width": 0 } } },\n' +
        '  "legend": { "data": ["子项目1", "子项目2", "子项目3"] },\n' +
        '  "xAxis": [{\n' +
        '      "type": "category",\n' +
        '      "boundaryGap": false,\n' +
        '      "data": ["2019-05-08","2019-05-09","2019-05-10","2019-05-11","2019-05-12","2019-05-13","2019-05-14","2019-05-15","2019-05-16","2019-05-17","2019-05-18","2019-05-19","2019-05-20","2019-05-21","2019-05-22","2019-05-23","2019-05-24","2019-05-25","2019-05-26","2019-05-27","2019-05-28","2019-05-29","2019-05-30","2019-05-31","2019-06-01","2019-06-02","2019-06-03","2019-06-04","2019-06-05","2019-06-06","2019-06-07"],\n' +
        '      "axisTick": { "show": false },\n' +
        '      "axisLine": { "show": false }\n' +
        '  }],\n' +
        '  "yAxis": [{ "type": "value", "axisTick": { "show": false }, "axisLine": { "show": false }, "splitLine": { "lineStyle": { "color": "rgba(0, 0, 0, .38)", "type": "dashed" } } }],\n' +
        '  "series": [\n' +
        '    {\n' +
        '      "name": "子项目1", "type": "line", "smooth": true, "itemStyle": { "color": "#d23f31" }, "areaStyle": { "normal": {} }, "z": 3,\n' +
        '      "data": ["18","14","22","9","7","18","10","12","13","16","6","9","15","15","12","15","8","14","9","10","29","22","14","22","9","10","15","9","9","15","0"]\n' +
        '    },\n' +
        '    {\n' +
        '      "name": "子项目2", "type": "line", "smooth": true, "itemStyle": { "color": "#f1e05a" }, "areaStyle": { "normal": {} }, "z": 2,\n' +
        '      "data": ["31","33","30","23","16","29","23","37","41","29","16","13","39","23","38","136","89","35","22","50","57","47","36","59","14","23","46","44","51","43","0"]\n' +
        '    },\n' +
        '    {\n' +
        '      "name": "子项目3", "type": "line", "smooth": true, "itemStyle": { "color": "#4285f4" }, "areaStyle": { "normal": {} }, "z": 1,\n' +
        '      "data": ["35","42","73","15","43","58","55","35","46","87","36","15","44","76","130","73","50","20","21","54","48","73","60","89","26","27","70","63","55","37","0"]\n' +
        '    }\n' +
        '  ]\n' +
        '}\n' +
        '```\n' +
        '\n' +
        '### 3.项目问题分析\n' +
        '\n' +
        '### 4.项目目标\n' +
        '\n' +
        '### 5.项目策略及活动\n' +
        '\n' +
        '### 6.预期风险分析\n' +
        '\n' +
        '### 7.项目创新性\n' +
        '\n' +
        '## 第二部分：项目实施计划\n' +
        '\n' +
        '### 1.项目产出\n' +
        '\n' +
        '| 预期产出 | 具体活动 | 时间安排 | 社会资源 | 预算 | 合计（元） |\n' +
        '| -------- | -------- | -------- | -------- | ---- | ---------- |\n' +
        '|          |          |          |          |      |            |\n' +
        '|          |          |          |          |      |            |\n' +
        '\n' +
        '### 具体实施步骤\n' +
        '\n' +
        '#### 任务列表\n' +
        '\n' +
        '- [X] 任务1\n' +
        '- [ ] 任务2\n' +
        '- [ ] 任务3\n' +
        '\n' +
        '## 第三部分：项目组织结构\n' +
        '\n' +
        '## 第四部分：社会资源拓展\n' +
        '\n' +
        '## 第五部分：媒体支持及项目宣传\n' +
        '\n' +
        '### 媒体介绍\n' +
        '\n' +
        '#### 校园媒体\n' +
        '\n' +
        '#### 社会媒体\n' +
        '\n' +
        '### 宣传规划\n' +
        '\n' +
        '## 第六部分：项目社会效应分析\n' +
        '\n' +
        '## 第七部分：项目经费预算\n' +
        '\n' +
        '### （一）项目基本费用\n' +
        '\n' +
        '| 事项 | 用途 | 其他赞助来源 | 总计（元） |\n' +
        '| ---- | ---- | ------------ | ---------- |\n' +
        '|      |      |              |            |\n' +
        '|      |      |              |            |\n' +
        '\n' +
        '### （二）宣传及制作材料费\n' +
        '\n' +
        '| 品名 | 用途 | 数量 | 规格 | 总计（元） | 备注 |\n' +
        '| ---- | ---- | ---- | ---- | ---------- | ---- |\n' +
        '|      |      |      |      |            |      |\n' +
        '|      |      |      |      |            |      |\n' +
        '\n' +
        '### （三）志愿者管理费用\n' +
        '\n' +
        '### （四）场地及其他费用\n' +
        '\n' +
        '## 第八部分：附录\n',
    model2:'![ ](https://upload.shejihz.com/2019/03/0fbab89ce4d106b4a55609aebbb861ba.jpg)\n' +
        '\n' +
        '# 会议纪要\n' +
        '\n' +
        '会议部门：\n' +
        '\n' +
        '会议内容：\n' +
        '\n' +
        '记录人：\n' +
        '\n' +
        '会议主持：\n' +
        '\n' +
        '会议地方：\n' +
        '\n' +
        '会议日期：\n' +
        '\n' +
        '出席人员：\n' +
        '\n' +
        '#### 一、会议议题\n' +
        '\n' +
        '\n' +
        '#### 二、工作汇报\n' +
        '\n' +
        '\n' +
        '#### 三、待办会议\n' +
        '\n' +
        '\n' +
        '#### 四、问题讨论\n' +
        '\n' +
        '#### 五、会议总结\n' +
        '\n' +
        '\n' +
        '\n' +
        '抄送：参会人员\n' +
        '\n' +
        '传达：相关部门\n',
    model3:'![ ](https://upload.shejihz.com/2019/03/0fbab89ce4d106b4a55609aebbb861ba.jpg)\n' +
        '\n' +
        '# 项目管理\n' +
        '\n' +
        '```mermaid\n' +
        'gantt\n' +
        'dateFormat YYYY-MM-DD\n' +
        'title 项目管理样例\n' +
        'section 第一节\n' +
        '已完成的任务 :done, des1, 2022-01-06,2022-01-08\n' +
        '活动任务 :active, des2, 2022-01-09, 3d\n' +
        '今后的任务 : des3, after des2, 5d\n' +
        '今后的任务2 : des4, after des3, 5d\n' +
        'section 关键任务\n' +
        '关键行中已完成的任务 :crit, done, 2022-01-06,24h\n' +
        '实现解析器和同步 :crit, done, after des1, 2d\n' +
        '为解析器创建测试 :crit, active, 3d\n' +
        '关键线路的未来任务 :crit, 5d\n' +
        '为渲染器创建测试 :2d\n' +
        '添加到 mermaid :1d\n' +
        'section 文档\n' +
        '描述甘特语法 :active, a1, after des1, 3d\n' +
        '将甘特图添加到演示页面 :after a1 , 20h\n' +
        '将另一个图表添加到演示页面:doc1, after a1 , 48h\n' +
        'section 最后一节\n' +
        '描述甘特语法 :after doc1, 3d\n' +
        '将甘特图添加到演示页面:20h\n' +
        '将另一个图表添加到演示页面:48h\n' +
        '```\n',
    model4:'![](https://upload.shejihz.com/2019/03/0fbab89ce4d106b4a55609aebbb861ba.jpg)\n' +
        '\n' +
        '# 工作周报表（示例）\n' +
        '\n' +
        '## 上周工作完成情况\n' +
        '\n' +
        '\n' +
        '| 汇报人：XXX          | 部门：XX部           | 职务：XX部长 |\n' +
        '| ---------------------- | ---------------------- | -------------- |\n' +
        '| 工作事项（上周计划） | 完成（处理）结果     | 处理时间     |\n' +
        '| 1.网站信息更新工作   | 1.①搜集网络文章20篇 | 1.2022-08-01 |\n' +
        '\n' +
        '## 本周工作计划\n' +
        '\n' +
        '\n' +
        '| 汇报人：XXX          | 部门：XX部             | 职务：XX部长 |\n' +
        '| ---------------------- | ------------------------ | -------------- |\n' +
        '| 工作事项（本周计划） | 完成（处理）结果       | 处理时间     |\n' +
        '| 1.网站信息更新工作   | 1.①搜集网络文章20篇； | 1.2022-08-08 |\n' +
        '\n' +
        '```mermaid\n' +
        'gantt\n' +
        'dateFormat YYYY-MM-DD\n' +
        'title 项目管理样例\n' +
        'section 第一节\n' +
        '已完成的任务 :done, des1, 2022-01-06,2022-01-08\n' +
        '活动任务 :active, des2, 2022-01-09, 3d\n' +
        '今后的任务 : des3, after des2, 5d\n' +
        '今后的任务2 : des4, after des3, 5d\n' +
        'section 关键任务\n' +
        '关键行中已完成的任务 :crit, done, 2022-01-06,24h\n' +
        '实现解析器和同步 :crit, done, after des1, 2d\n' +
        '为解析器创建测试 :crit, active, 3d\n' +
        '关键线路的未来任务 :crit, 5d\n' +
        '为渲染器创建测试 :2d\n' +
        '添加到 mermaid :1d\n' +
        'section 文档\n' +
        '描述甘特语法 :active, a1, after des1, 3d\n' +
        '将甘特图添加到演示页面 :after a1 , 20h\n' +
        '将另一个图表添加到演示页面:doc1, after a1 , 48h\n' +
        'section 最后一节\n' +
        '描述甘特语法 :after doc1, 3d\n' +
        '将甘特图添加到演示页面:20h\n' +
        '将另一个图表添加到演示页面:48h\n' +
        '```\n' +
        '\n' +
        '\n' +
        '```\n',
    model5:'![ ](https://upload.shejihz.com/2019/03/0fbab89ce4d106b4a55609aebbb861ba.jpg)\n' +
        '\n' +
        '# 需求调研报告（示例）\n' +
        '\n' +
        '## [XXXX]公司[客户名称]软件项目\n' +
        '\n' +
        '### 修改历史\n' +
        '\n' +
        '| 日期 | 版本 | 作者 | 修改内容 | 评审号 | 更改请求号 |\n' +
        '| ---- | ---- | ---- | -------- | ------ | ---------- |\n' +
        '|      |      |      |          |        |            |\n' +
        '|      |      |      |          |        |            |\n' +
        '\n' +
        '### 一、引言\n' +
        '\n' +
        '#### 1.1编写目的\n' +
        '\n' +
        '\n' +
        '#### 1.2文档范围\n' +
        '\n' +
        '\n' +
        '#### 1.3预期读者和阅读建议\n' +
        '\n' +
        '\n' +
        '#### 1.4参考资料\n' +
        '\n' +
        '| 名称 | 日期 | 作者 | 版本 | 出版社 |\n' +
        '| ---- | ---- | ---- | ---- | ------ |\n' +
        '|      |      |      |      |        |\n' +
        '|      |      |      |      |        |\n' +
        '\n' +
        '### 二、项目描述\n' +
        '\n' +
        '#### 2.1、项目背景\n' +
        '\n' +
        '\n' +
        '#### 2.2、项目名称\n' +
        '\n' +
        '\n' +
        '#### 2.3、项目概述\n' +
        '\n' +
        '\n' +
        '#### 2.4、项目关联性\n' +
        '\n' +
        '\n' +
        '#### 2.5、设计和实现上的限制\n' +
        '\n' +
        '\n' +
        '#### 2.6、假定条件和约束\n' +
        '\n' +
        '\n' +
        '#### 2.7、名词/术语解释\n' +
        '\n' +
        '\n' +
        '### 三、用户环境描述\n' +
        '\n' +
        '#### 3.1、用户单位组织结构\n' +
        '\n' +
        '\n' +
        '#### 3.2、用户部门设置与职责\n' +
        '\n' +
        '\n' +
        '#### 3.3、用户业务关系描述\n' +
        '\n' +
        '\n' +
        '#### 3.4系统面向的用户群\n' +
        '\n' +
        '\n' +
        '#### 3.5、关键计算机资源\n' +
        '\n' +
        '\n' +
        '#### 3.6、用户环境中的其他应用系统分布\n' +
        '\n' +
        '\n' +
        '### 四、功能性需求描述\n' +
        '\n' +
        '#### 4.1、用户各部门当前的工作模式\n' +
        '\n' +
        '\n' +
        '#### 4.2、构建该系统的目标\n' +
        '\n' +
        '\n' +
        '#### 4.3、功能结构图\n' +
        '\n' +
        '\n' +
        '#### 4.4、功能点需求\n' +
        '\n' +
        '\n' +
        '#### 4.5、接口需求\n' +
        '\n' +
        '\n' +
        '### 五、非功能性需求描述\n' +
        '\n' +
        '#### 5.1、系统环境需求\n' +
        '\n' +
        '\n' +
        '#### 5.2、易用性和用户体验需求\n' +
        '\n' +
        '\n' +
        '#### 5.3软硬件技术需求\n' +
        '\n' +
        '\n' +
        '#### 5.4、安全性需求\n' +
        '\n' +
        '\n' +
        '#### 5.5、可维护性需求\n' +
        '\n' +
        '\n' +
        '#### 5.6、对培训的需求 \n' +
        '\n' +
        '\n' +
        '### 六、其他\n' +
        '\n' +
        '#### 6.1、软件应当遵循的标准或规范\n' +
        '\n' +
        '\n' +
        '#### 6.2定义、首字母缩写词和缩略语\n' +
        '\n' +
        '\n' +
        '#### 6.3、附件\n',
    model6:'![ ](https://upload.shejihz.com/2019/03/0fbab89ce4d106b4a55609aebbb861ba.jpg)\n' +
        '\n' +
        '# 需求规格说明书（示例）\n' +
        '\n' +
        '## [XXXX]公司[客户名称]软件项目\n' +
        '\n' +
        '### 修改历史\n' +
        '\n' +
        '| 日期 | 版本 | 作者 | 修改内容 | 评审号 | 更改请求号 |\n' +
        '| ---- | ---- | ---- | -------- | ------ | ---------- |\n' +
        '|      |      |      |          |        |            |\n' +
        '|      |      |      |          |        |            |\n' +
        '\n' +
        '### 一、引言\n' +
        '\n' +
        '#### 1.1编写目的\n' +
        '\n' +
        '#### 1.2文档约定\n' +
        '\n' +
        '#### 1.3读者对象\n' +
        '\n' +
        '#### 1.4术语和缩略词\n' +
        '\n' +
        '#### 1.5参考文档\n' +
        '\n' +
        '### 二、项目概述\n' +
        '\n' +
        '#### 2.1、项目背景\n' +
        '\n' +
        '#### 2.2、项目目标\n' +
        '\n' +
        '#### 2.3、需求范围\n' +
        '\n' +
        '#### 2.4、总体框架\n' +
        '\n' +
        '#### 2.5、组织机构\n' +
        '\n' +
        '#### 2.6、用户特点\n' +
        '\n' +
        '#### 2.7、设计约束\n' +
        '\n' +
        '### 三、功能性需求\n' +
        '\n' +
        '#### 3.1、总体流程\n' +
        '\n' +
        '#### 3.2、角色定义\n' +
        '\n' +
        '#### 3.3、系统功能\n' +
        '\n' +
        '#### 3.4、功能描述\n' +
        '\n' +
        '#### 3.4.1、用例图\n' +
        '\n' +
        '```plantuml\n' +
        '@startuml\n' +
        'left to right direction\n' +
        'actor Guest as g\n' +
        'package Professional {\n' +
        '  actor Chef as c\n' +
        '  actor "Food Critic" as fc\n' +
        '}\n' +
        'package Restaurant {\n' +
        '  usecase "Eat Food" as UC1\n' +
        '  usecase "Pay for Food" as UC2\n' +
        '  usecase "Drink" as UC3\n' +
        '  usecase "Review" as UC4\n' +
        '}\n' +
        'fc --> UC4\n' +
        'g --> UC1\n' +
        'g --> UC2\n' +
        'g --> UC3\n' +
        '@enduml\n' +
        '```\n' +
        '\n' +
        '### 四、非功能性需求\n' +
        '\n' +
        '#### 4.1、软件需求\n' +
        '\n' +
        '#### 4.2、硬件需求\n' +
        '\n' +
        '### 六、其他需求\n' +
        '\n' +
        '### 七、数据字典\n' +
        '\n' +
        '### 八、附件\n',
};